cavity/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
    (0 0 0)
    (1 0 0)
    (1 3 0)
    (0 3 0)
    (0 0 1)
    (1 0 1)
    (1 3 1)
    (0 3 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (0.5 0 -.25)
    //arc 1 2 (1.25 .5 -.25)
    //arc 2 3 (.5 1.25 0)
    //arc 3 0 (-.25 .5 0)
);

boundary
(
   // movingWall
    //{
       // type wall;
       // faces
       // (
            //(3 7 6 2)
       // );
   //}
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
            (3 7 6 2)
        );
    }
    //frontAndBack
    //{
        //type empty;
        //faces
        //(
            //(0 3 2 1)
            //(4 5 6 7)
        //);
    //}
);

mergePatchPairs
(
);

// ************************************************************************* //
